zhangruiyep/Embeded-nrf52832/examples/ble_peripheral/ble_app_uart/audio/es8374.c
    reg = 0x1d;

    res = es8374_write_reg(reg, 0x02);
    res |= es8374_read_reg(0x1c, &reg); // set spk mixer
    reg |= 0x80;
    res |= es8374_write_reg(0x1c, reg);
    res |= es8374_write_reg(0x1D, 0x02); // spk set
    res |= es8374_write_reg(0x1F, 0x00); // spk set
    res |= es8374_write_reg(0x1E, 0xA0); // spk on

    return res;
}

#ifdef FEATURE_MIC_EN
int es8374_config_adc_input(es_adc_input_t input)
{
    int res = 0;
    uint8_t reg = 0;

    res |= es8374_read_reg(0x21, &reg);
    if (res == 0) {
        reg = (reg & 0xcf) | 0x14;
        res |= es8374_write_reg( 0x21, reg);
    }

    return res;
}

int es8374_set_mic_gain(es_mic_gain_t gain)
{
    int res = 0;

    if (gain > MIC_GAIN_MIN && gain < MIC_GAIN_24DB) {
        int gain_n = 0;
        gain_n = (int)gain / 3;
        res = es8374_write_reg(0x22, gain_n | (gain_n << 4)); //MIC PGA
    } else {
        res = -1;
        LOG_8374("invalid microphone gain!");
    }

    return res;
}
#endif

int es8374_codec_set_voice_volume(int volume)
{
    int res = 0;

    if (volume < 0) {
        volume = 192;
    } else if (volume > 96) {
        volume = 0;
    } else {
        volume = 192 - volume * 2;
    }

    res = es8374_write_reg(0x38, volume);

    return res;
}

int es8374_codec_get_voice_volume(int *volume)
{
    int res = 0;
    uint8_t reg = 0;

    res = es8374_read_reg(0x38, &reg);

    if (res == ESP_FAIL) {
        *volume = 0;
    } else {
        *volume = (192 - reg) / 2;
        if (*volume > 96) {
            *volume = 100;
        }
    }

    return res;
}

static int es8374_set_adc_dac_volume(int mode, int volume, int dot)
{
    int res = 0;

    if ( volume < -96 || volume > 0 ) {
        LOG_8374("Warning: volume < -96! or > 0!");
        if (volume < -96) {
            volume = -96;
        } else {
            volume = 0;
        }
    }
    dot = (dot >= 5 ? 1 : 0);
    volume = (-volume << 1) + dot;
    if (mode == ES_MODULE_ADC || mode == ES_MODULE_ADC_DAC) {
        res |= es8374_write_reg(0x25, volume);
    }
    if (mode == ES_MODULE_DAC || mode == ES_MODULE_ADC_DAC) {
        res |= es8374_write_reg(0x38, volume);
    }

    return res;
}

//#ifdef FEATURE_MIC_EN
#if 0
static int es8374_set_d2se_pga(es_d2se_pga_t gain)
{
    int res = 0;
    uint8_t reg = 0;

    if (gain > D2SE_PGA_GAIN_MIN && gain < D2SE_PGA_GAIN_MAX) {
        res = es8374_read_reg(0x21, &reg);
        reg &= 0xfb;
        reg |= gain << 2;
        res = es8374_write_reg(0x21, reg); //MIC PGA
    } else {
        res = 0xff;
        LOG_8374("invalid microphone gain!");
    }

    return res;
}
#endif

static int es8374_init_reg(es_mode_t ms_mode, uint8_t fmt, es_i2s_clock_t cfg, es_dac_output_t out_channel, es_adc_input_t in_channel)
{
    int res = 0;
    uint8_t reg;

    res |= es8374_write_reg(0x00, 0x3F); //IC Rst start
    res |= es8374_write_reg(0x00, 0x03); //IC Rst stop
    res |= es8374_write_reg(0x01, 0x7F); //IC clk on

    res |= es8374_read_reg(0x0F, &reg);
    reg &= 0x7f;
    reg |=  (ms_mode << 7);
    res |= es8374_write_reg( 0x0f, reg); //CODEC IN I2S SLAVE MODE

    res |= es8374_write_reg(0x6F, 0xA0); //pll set:mode enable
    res |= es8374_write_reg(0x72, 0x41); //pll set:mode set
    res |= es8374_write_reg(0x09, 0x01); //pll set:reset on ,set start
    res |= es8374_write_reg(0x0C, 0x22); //pll set:k
    res |= es8374_write_reg(0x0D, 0x2E); //pll set:k
    res |= es8374_write_reg(0x0E, 0xC6); //pll set:k
    res |= es8374_write_reg(0x0A, 0x3A); //pll set:
    res |= es8374_write_reg(0x0B, 0x07); //pll set:n
    res |= es8374_write_reg(0x09, 0x41); //pll set:reset off ,set stop

    res |= es8374_i2s_config_clock(cfg);

    res |= es8374_write_reg(0x24, 0x08); //adc set
    res |= es8374_write_reg(0x36, 0x00); //dac set
    res |= es8374_write_reg(0x12, 0x30); //timming set
    res |= es8374_write_reg(0x13, 0x20); //timming set

    res |= es8374_config_fmt(ES_MODULE_ADC, fmt);
    res |= es8374_config_fmt(ES_MODULE_DAC, fmt);

    res |= es8374_write_reg(0x21, 0x50); //adc set: SEL LIN1 CH+PGAGAIN=0DB
    res |= es8374_write_reg(0x22, 0xFF); //adc set: PGA GAIN=0DB
    res |= es8374_write_reg(0x21, 0x14); //adc set: SEL LIN1 CH+PGAGAIN=18DB
    res |= es8374_write_reg(0x22, 0x55); //pga = +15db
    res |= es8374_write_reg(0x08, 0x21); //set class d divider = 33, to avoid the high frequency tone on laudspeaker
    res |= es8374_write_reg(0x00, 0x80); // IC START

    res |= es8374_set_adc_dac_volume(ES_MODULE_ADC, 0, 0);      // 0db
    res |= es8374_set_adc_dac_volume(ES_MODULE_DAC, 0, 0);      // 0db

    res |= es8374_write_reg(0x14, 0x8A); // IC START
    res |= es8374_write_reg(0x15, 0x40); // IC START
    res |= es8374_write_reg(0x1A, 0xA0); // monoout set
    res |= es8374_write_reg(0x1B, 0x19); // monoout set
    res |= es8374_write_reg(0x1C, 0x90); // spk set
    res |= es8374_write_reg(0x1D, 0x01); // spk set
    res |= es8374_write_reg(0x1F, 0x00); // spk set
    res |= es8374_write_reg(0x1E, 0x20); // spk on
    res |= es8374_write_reg(0x28, 0x00); // alc set
    res |= es8374_write_reg(0x25, 0x00); // ADCVOLUME on
    res |= es8374_write_reg(0x38, 0x00); // DACVOLUME on
    res |= es8374_write_reg(0x37, 0x30); // dac set
    res |= es8374_write_reg(0x6D, 0x60); //SEL:GPIO1=DMIC CLK OUT+SEL:GPIO2=PLL CLK OUT
    res |= es8374_write_reg(0x71, 0x05); //for automute setting
    res |= es8374_write_reg(0x73, 0x70);

    res |= es8374_config_dac_output(out_channel);  //0x3c Enable DAC and Enable Lout/Rout/1/2
#ifdef FEATURE_MIC_EN
    res |= es8374_config_adc_input(in_channel);  //0x00 LINSEL & RINSEL, LIN1/RIN1 as ADC Input; DSSEL,use one DS Reg11; DSR, LINPUT1-RINPUT1
#endif
    res |= es8374_codec_set_voice_volume(0);

    res |= es8374_write_reg(0x37, 0x00); // dac set

    return res;
}

int es8374_codec_init(void)
{
    if (es8374_codec_initialized()) {
        ESP_LOGW(ES8374_TAG, "The es8374 codec has already been initialized!");
        return ESP_FAIL;
    }
    int res = 0;
    es_i2s_clock_t clkdiv;

