zhangruiyep/Embeded-nrf52832/examples/ble_peripheral/ble_app_uart/audio/es8374.c
    clkdiv.lclk_div = LCLK_DIV_96;
    //SCK = 2 * LRCK * CONFIG.SWIDTH 
    clkdiv.sclk_div = MCLK_DIV_3;

    i2s_init();

    i2c_init(); // ESP32 in master mode

    res |= es8374_stop(ES8374_MODULE_DEFAULT);
    res |= es8374_init_reg(ES8374_MODE_DEFAULT, (ES8374_BIT_LENGTH_DEFAULT << 4) | ES8374_I2S_FMT_DEFAULT, clkdiv,
            ES8374_OUTPUT_DEFAULT, ES8374_INPUT_DEFAULT);
#ifdef FEATURE_MIC_EN
    //res |= es8374_set_mic_gain(MIC_GAIN_15DB);
    //res |= es8374_set_d2se_pga(D2SE_PGA_GAIN_EN);
#endif
    /* already in es8374_init_reg(), no need to config again */
    //res |= es8374_config_fmt(ES8374_MODULE_DEFAULT, ES8374_I2S_FMT_DEFAULT);
    //res |= es8374_codec_config_i2s(ES8374_MODULE_DEFAULT, &(cfg->i2s_iface));
    codec_init_flag = 1;
    return res;
}

int es8374_codec_deinit(void)
{
    codec_init_flag = 0;
    return es8374_write_reg(0x00, 0x7F); // IC Reset and STOP
}

int es8374_codec_config_i2s(es_module_t mode, audio_hal_codec_i2s_iface_t *iface)
{
    int res = 0;
    es_bits_length_t tmp = BIT_LENGTH_16BITS;
    res |= es8374_config_fmt(mode, iface->fmt);
    if (iface->bits == AUDIO_HAL_BIT_LENGTH_16BITS) {
        tmp = BIT_LENGTH_16BITS;
    } else if (iface->bits == AUDIO_HAL_BIT_LENGTH_24BITS) {
        tmp = BIT_LENGTH_24BITS;
    } else {
        tmp = BIT_LENGTH_32BITS;
    }
    res |= es8374_set_bits_per_sample(ES_MODULE_ADC_DAC, tmp);
    return res;
}

int es8374_codec_ctrl_state(audio_hal_codec_mode_t mode, audio_hal_ctrl_t ctrl_state)
{
    int res = 0;
    es_module_t es_mode_t = ES_MODULE_DAC;
    switch (mode) {
        case AUDIO_HAL_CODEC_MODE_ENCODE:
            es_mode_t  = ES_MODULE_ADC;
            break;
        case AUDIO_HAL_CODEC_MODE_LINE_IN:
            es_mode_t  = ES_MODULE_LINE;
            break;
        case AUDIO_HAL_CODEC_MODE_DECODE:
            es_mode_t  = ES_MODULE_DAC;
            break;
        case AUDIO_HAL_CODEC_MODE_BOTH:
            es_mode_t  = ES_MODULE_ADC_DAC;
            break;
        default:
            es_mode_t = ES_MODULE_DAC;
            ESP_LOGW(ES8374_TAG, "Codec mode not support, default is decode mode");
            break;
    }
    if (AUDIO_HAL_CTRL_STOP == ctrl_state) {
        res = es8374_stop(es_mode_t);
    } else {
        res = es8374_start(es_mode_t);
        ESP_LOGD(ES8374_TAG, "start default is decode mode:%d", es_mode_t);
    }
    return res;
}



